In [18]:
import pandas as pd
import numpy as np

In [25]:
lables=['a','b','c']
my_data=[10,20,30]
arr=np.array(my_data)
d={'a':10}

In [13]:
pd.Series(my_data)

0    10
1    20
2    30
dtype: int64

In [15]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [26]:
pd.Series(data=my_data,index=lables)

a    10
b    20
c    30
dtype: int64

In [27]:
pd.Series(d)

a    10
dtype: int64

In [2]:
x=pd.Series([1,2,3],['JAVA','C','Python'])
x

JAVA      1
C         2
Python    3
dtype: int64

In [21]:
from numpy.random import rand
df=pd.DataFrame(rand(3,3),['A','B','C'],['X','Y','Z'])

In [24]:
df

          X         Y         Z
A  0.925094  0.964265  0.463295
B  0.806830  0.853177  0.381970
C  0.369193  0.592646  0.820605

In [31]:
df['X']

A    0.925094
B    0.806830
C    0.369193
Name: X, dtype: float64

In [34]:
df.X

A    0.925094
B    0.806830
C    0.369193
Name: X, dtype: float64

In [40]:
df[['X','Y']]

          X         Y
A  0.925094  0.964265
B  0.806830  0.853177
C  0.369193  0.592646

In [44]:
df >0

      X     Y     Z
A  True  True  True
B  True  True  True
C  True  True  True

In [46]:
df[df>0]

          X         Y         Z
A  0.925094  0.964265  0.463295
B  0.806830  0.853177  0.381970
C  0.369193  0.592646  0.820605

In [49]:
df['X']>0

A    True
B    True
C    True
Name: X, dtype: bool

In [52]:
df.reset_index()

  index         X         Y         Z
0     A  0.925094  0.964265  0.463295
1     B  0.806830  0.853177  0.381970
2     C  0.369193  0.592646  0.820605

In [54]:
df

          X         Y         Z
A  0.925094  0.964265  0.463295
B  0.806830  0.853177  0.381970
C  0.369193  0.592646  0.820605

In [56]:
new='A B C D E'.split()

In [57]:
new

['A', 'B', 'C', 'D', 'E']

In [60]:
df

          X         Y         Z
A  0.925094  0.964265  0.463295
B  0.806830  0.853177  0.381970
C  0.369193  0.592646  0.820605

In [61]:
df.set_index('New_Ind')

KeyError: "None of ['New_Ind'] are in the columns"